/*********************************************************************************************************
**				                               Small RTOS(51)
**                                   The Real-Time Kernel(For Keil c51)
**
**                                  (c) Copyright 2002-2003, chenmingji
**                                           All Rights Reserved
**
**                                                  V1.20.1
**
**
**--------------文件信息--------------------------------------------------------------------------------
**文   件   名: OS_CORE.C
**创   建   人: 陈明计
**最后修改日期: 2004年2月4日
**描        述: Small RTOS(51)与CPU无关的核心代码
**
**--------------历史版本信息----------------------------------------------------------------------------
** 创建人: 陈明计
** 版  本: V0.50~V1.00
** 日　期: 2002年2月22日~2002年6月20日
** 描　述: 基本完成Small RTOS核
**
**------------------------------------------------------------------------------------------------------
** 修改人: 陈明计
** 版  本: V1.10~V1.21
** 日　期: 2002年9月1日~2003年1月23日
** 描　述: 完善Small RTOS
**
**------------------------------------------------------------------------------------------------------
** 修改人: 陈明计
** 版  本: V1.20.0
** 日　期: 2003年8月17日
** 描　述: 增加支持任务动态建立和删除，函数功能向一般的RTOS靠齐
**
**------------------------------------------------------------------------------------------------------
** 修改人: 陈明计
** 版  本: V1.20.1
** 日　期: 2004年2月4日
** 描　述: 修改OSWait(K_SIG | K_TMO, x) 只能通过信号唤醒的bug。
**
**--------------当前版本修订------------------------------------------------------------------------------
** 修改人: 
** 日　期:
** 描　述:
**
**------------------------------------------------------------------------------------------------------
********************************************************************************************************/

#define  IN_OS_CORE
#include "config.h"

uint8 data OSIntNesting;

uint8 data OSTaskID;
uint8 data OSNextTaskID;

uint8 data OSWaitTick[OS_MAX_TASKS];
#if OS_MAX_TASKS < 9
uint8 data OSTaskRuning[1];
uint8 data OSTaskCreated[1];
#else
uint8 data OSTaskRuning[2];
uint8 data OSTaskCreated[2];
#endif

uint8 const OSMapTbl[] = {0x01, 0x02, 0x04, 0x08, 0x10, 0x20, 0x40, 0x80, 0x00};
uint8 data Os_Enter_Sum;


void  OSSched(void) small;

/*********************************************************************************************************
** 函数名称: OSInit
** 功能描述: 系统变量初始化
** 输　入: 无
** 输　出: 无
** 全局变量: 
** 调用模块: 无
**
** 作　者: 陈明计
** 日　期: 2003年8月3日
**-------------------------------------------------------------------------------------------------------
** 修改人:
** 日　期:
**------------------------------------------------------------------------------------------------------
********************************************************************************************************/
        void OSInit(void) small
{
    OSTaskRuning[0] = 0;
    OSTaskCreated[0] = 0;
#if OS_MAX_TASKS > 8
    OSTaskRuning[1] = 0;
    OSTaskCreated[1] = 0;
#endif
    Os_Enter_Sum = 0;
    OSTaskID = OS_MAX_TASKS;
    OSNextTaskID = 0;
    OSIntNesting = 0;
    OSCPUInit();
}

/*********************************************************************************************************
** 函数名称: _OSTaskCreate
** 功能描述: 创建任务
** 输　入: TaskID:任务ID
**         task  :任务地址
**         ptos  :任务堆栈，在51中为重入栈
** 输　出: 无
** 全局变量: 
** 调用模块: 无
**
** 作　者: 陈明计
** 日　期: 2003年8月3日
**-------------------------------------------------------------------------------------------------------
** 修改人:
** 日　期:
**------------------------------------------------------------------------------------------------------
********************************************************************************************************/
        uint8 _OSTaskCreate(uint8 TaskID, void (code * task)(void), void xdata *ptos) small
{
    if (TaskID < OS_MAX_TASKS)
    {
        OS_ENTER_CRITICAL();
#if OS_MAX_TASKS < 9
        if ((OSTaskCreated[0] & OSMapTbl[TaskID]) != 0)
        {
            return FALSE;
        }
        OSTaskCreated[0] |= OSMapTbl[TaskID];
        OSTaskRuning[0] |= OSMapTbl[TaskID];
#else
        if (TaskID < 8)
        {
            if ((OSTaskCreated[0] & OSMapTbl[TaskID]) != 0)
            {
                return FALSE;
            }
            OSTaskCreated[0] |= OSMapTbl[TaskID];
            OSTaskRuning[0] |= OSMapTbl[TaskID];
        }
        else
        {
            if ((OSTaskCreated[1] & OSMapTbl[TaskID & 0x07]) != 0)
            {
                return FALSE;
            }
            OSTaskCreated[1] |= OSMapTbl[TaskID & 0x07];
            OSTaskRuning[1] |= OSMapTbl[TaskID & 0x07];
        }
#endif
        OSTaskStkInit(task, ptos, TaskID);
        OSSched();
        OS_EXIT_CRITICAL();
        return TRUE;
    }
    return FALSE;
}

/*********************************************************************************************************
** 函数名称: OSTaskDel
** 功能描述: 删除任务
** 输　入: TaskID:任务ID
** 输　出: 无
** 全局变量: 
** 调用模块: 无
**
** 作　者: 陈明计
** 日　期: 2003年8月3日
**-------------------------------------------------------------------------------------------------------
** 修改人:
** 日　期:
**------------------------------------------------------------------------------------------------------
********************************************************************************************************/
        uint8 OSTaskDel(uint8 TaskID) small
{
    if (TaskID < OS_MAX_TASKS)
    {
        OS_ENTER_CRITICAL();
#if OS_MAX_TASKS < 9
        OSTaskCreated[0] &= ~OSMapTbl[TaskID];
#else
        if (TaskID < 8)
        {
            OSTaskCreated[0] &= ~OSMapTbl[TaskID];
        }
        else
        {
            OSTaskCreated[1] &= ~OSMapTbl[TaskID & 0x07];
        }
#endif
        OSTaskStkDel(TaskID);
        OSSched();
        OS_EXIT_CRITICAL();
        return TRUE;
    }
    else
    {
        return FALSE;
    }
}

/*********************************************************************************************************
** 函数名称: OSTaskResume
** 功能描述: 恢复任务
** 输　入: TaskID : 任务ID
** 输　出: 无
** 全局变量: OSTaskRuning
** 调用模块: 无
**
** 作　者: 陈明计
** 日　期: 2003年8月3日
**-------------------------------------------------------------------------------------------------------
** 修改人:
** 日　期:
**------------------------------------------------------------------------------------------------------
********************************************************************************************************/
        void OSTaskResume(uint8 TaskID)  small
{
    if (TaskID < OS_MAX_TASKS)
    {
        OS_ENTER_CRITICAL();
#if OS_MAX_TASKS < 9
        OSTaskRuning[0] |= OSMapTbl[TaskID];
#else
        if (TaskID < 8)
        {
            OSTaskRuning[0] |= OSMapTbl[TaskID];
        }
        else
        {
            OSTaskRuning[1] |= OSMapTbl[TaskID & 0x07];
        }
#endif
        OS_EXIT_CRITICAL();
    }
    OSSched();                                              //开始任务切换
}

/*********************************************************************************************************
** 函数名称: OS_TaskSuspend
** 功能描述: 使指定任务休眠，但不进行任务切换
** 输　入: TaskID : 任务ID
** 输　出: 无
** 全局变量: OSWaitTick
** 调用模块: 无
**
** 作　者: 陈明计
** 日　期: 2003年8月3日
**-------------------------------------------------------------------------------------------------------
** 修改人:
** 日　期:
**-------------------------------------------------------------------------------------------------------
********************************************************************************************************/
        void OS_TaskSuspend(uint8 TaskID)    small
{
    if (TaskID < OS_MAX_TASKS)
    {
        OS_ENTER_CRITICAL();
#if OS_MAX_TASKS < 9
        OSTaskRuning[0] &= ~OSMapTbl[TaskID];
#else
        if (TaskID < 8)
        {
            OSTaskRuning[0] &= ~OSMapTbl[TaskID];
        }
        else
        {
            OSTaskRuning[1] &= ~OSMapTbl[TaskID & 0x07];
        }
#endif
        OS_EXIT_CRITICAL();
    }
}


/*********************************************************************************************************
** 函数名称: OSTaskSuspend
** 功能描述: 使指定任务休眠
** 输　入: TaskID : 任务ID
** 输　出: 无
** 全局变量: OSWaitTick
** 调用模块: OS_TaskSuspend,OSSched
**
** 作　者: 陈明计
** 日　期: 2003年8月3日
**-------------------------------------------------------------------------------------------------------
** 修改人:
** 日　期:
**-------------------------------------------------------------------------------------------------------
********************************************************************************************************/
        void OSTaskSuspend(uint8 TaskID)    small
{
    OSWaitTick[TaskID] = 0;                                 /* 没有超时处理         */

    OS_TaskSuspend(TaskID);
    OSSched();                                              /* 开始任务切换 */
}

/*********************************************************************************************************
** 函数名称: OSFindNextRunningTask
** 功能描述: 查找下一个优先级最高的就绪任务
** 输　入: 无
** 输　出: OSNextTaskID:存储查找结果
** 全局变量: OSTaskRuning,OSTaskCreated
** 调用模块: 无
**
** 作　者: 陈明计
** 日　期: 2003年8月3日
**-------------------------------------------------------------------------------------------------------
** 修改人:
** 日　期:
**-------------------------------------------------------------------------------------------------------
********************************************************************************************************/
        void OSFindNextRunningTask(void) small
{
    uint8 temp;

    temp = OSTaskRuning[0] & OSTaskCreated[0];
#if OS_MAX_TASKS < 9
                /* 查找处于就绪状态的任务中优先级最高的任务 */
    for (OSNextTaskID = 0; OSNextTaskID < OS_MAX_TASKS; OSNextTaskID++)
    {
        if ((temp & 0x01) != 0)
        {
            break;
        }
        temp = temp >> 1;
    }
    return;
#else
                /* 查找处于就绪状态的任务中优先级最高的任务 */
    for (OSNextTaskID = 0; OSNextTaskID < 8; OSNextTaskID++)
    {
        if ((temp & 0x01) != 0)
        {
            return;
        }
        temp = temp >> 1;
    }
    temp = OSTaskRuning[1] & OSTaskCreated[1];
    for (; OSNextTaskID < OS_MAX_TASKS; OSNextTaskID++)
    {
        if ((temp & 0x01) != 0)
        {
            break;
        }
        temp = temp >> 1;
    }
    return;
#endif
}

/*********************************************************************************************************
** 函数名称: OSIntExit
** 功能描述: 中断退出处理函数,在此进行中断后的任务切换
** 输　入: 无
** 输　出: 无
** 全局变量: OSIntNesting,OSNextTaskID
** 调用模块: OSIntCtxSw
**
** 作　者: 陈明计
** 日　期: 2003年8月3日
**-------------------------------------------------------------------------------------------------------
** 修改人:
** 日　期:
**------------------------------------------------------------------------------------------------------
********************************************************************************************************/
        uint8 OSIntExit(void)    small

{
    OS_ENTER_CRITICAL();
                /* 中断嵌套处理 */
    if (OSIntNesting > 0)
    {
        OSIntNesting--;
    }
    if (OSIntNesting == 0)
    {
        Os_Enter_Sum = 0;               /* 因为在中断中，所以关中断计数器为0 */
        OSFindNextRunningTask();
        OSIntCtxSw();                   /* 进行任务调度 */
        return TRUE;
    }
    OS_EXIT_CRITICAL();
    return FALSE;
}

/*********************************************************************************************************
** 函数名称: OSSched
** 功能描述: 非中断的任务切换函数
** 输　入: 无
** 输　出: 无
** 全局变量: OSIntNesting,OSNextTaskID
** 调用模块: OS_TASK_SW
**
** 作　者: 陈明计
** 日　期: 2003年8月3日
**------------------------------------------------------------------------------------------------------
** 修改人:
** 日　期:
**-------------------------------------------------------------------------------------------------------
********************************************************************************************************/
        void  OSSched(void) small

{
    OS_ENTER_CRITICAL();
    if (OSIntNesting == 0)              /* 是否是中断中调用 */
    {
        OSFindNextRunningTask();
        OS_TASK_SW();                   /* 进行任务调度 */
    }
    OS_EXIT_CRITICAL();
}

/*********************************************************************************************************
** 函数名称: OSTimeTick
** 功能描述: 系统时钟处理函数,处理各个任务的延时
** 输　入: 无
** 输　出: 无
** 全局变量: OSWaitTick
** 调用模块: OSIntSendSignal
**
** 作　者: 陈明计
** 日　期: 2003年8月3日
**------------------------------------------------------------------------------------------------------
** 修改人:
** 日　期:
**-------------------------------------------------------------------------------------------------------
********************************************************************************************************/
        void  OSTimeTick(void)  small
{
    uint8 i;

    for (i = 0; i < OS_MAX_TASKS; i++)                 
    {
        if (OSWaitTick[i] != 0 )
        {
            OSWaitTick[i]--;
            if (OSWaitTick[i] == 0)
            {
#if OS_MAX_TASKS < 9
                OSTaskRuning[0] |= OSMapTbl[i];
#else
                if (i < 8)
                {
                    OSTaskRuning[0] |= OSMapTbl[i];
                }
                else
                {
                    OSTaskRuning[1] |= OSMapTbl[i & 0x07];
                }
#endif
            }
        }
    }
    OSSched();
}

/*********************************************************************************************************
** 函数名称: OSTimeDly
** 功能描述: 系统等待函数,任务调用此函数可以等待一定时间
** 输　入:  ticks : 等待超时时的系统嘀嗒数
** 输　出 : 无
**
** 全局变量: OSWaitTick
** 调用模块: OS_TaskSuspend,OSSched
**
** 作　者: 陈明计
** 日　期: 2003年8月3日
**-------------------------------------------------------------------------------------------------------
** 修改人:
** 日　期:
**-------------------------------------------------------------------------------------------------------
********************************************************************************************************/
        void OSTimeDly(uint8 ticks)     small
{
    OSWaitTick[OSTaskID] = ticks;               /* 设置超时时间         */
    OS_ENTER_CRITICAL();
    while (OSWaitTick[OSTaskID] != 0)           /* 判断超时时间是否到   */
    {
        OS_TaskSuspend(OSTaskID);               /* 任务进入等待状态     */
        OSSched();                               /* 开始任务切换         */
    }
    OS_EXIT_CRITICAL();
}

/*********************************************************************************************************
** 函数名称: OSTimeDlyResume
** 功能描述: 让处在延时期的任务结束延时
** 输　入:  TaskID : 任务ID
** 输　出 : 无
** 全局变量: OSWaitTick
** 调用模块: OSTaskResume
**
** 作　者: 陈明计
** 日　期: 2003年8月3日
**-------------------------------------------------------------------------------------------------------
** 修改人:
** 日　期:
**-------------------------------------------------------------------------------------------------------
********************************************************************************************************/
        void OSTimeDlyResume(uint8 TaskID)    small
{
    OSWaitTick[TaskID] = 0;
    OSTaskResume(TaskID);
}


/*********************************************************************************************************
** 函数名称: OSWait
** 功能描述: 系统等待函数,任务调用此函数可以等待一定时间或信号
** 输　入: typ: 等待事件类型,目前可以取以下值,或是其中任意个值的按位或
**             K_SIG: 等待信号
**             K_TMO: 等待超时
**        ticks : 等待超时时的系统嘀嗒数
** 输　出 : NOT_OK : 参数错误
**         TMO_EVENT : 超时到
**         SIG_EVENT : 有信号
** 全局变量: OSWaitTick
** 调用模块: OSTaskSuspend,OSTimeDly,OS_ENTER_CRITICAL,OS_EXIT_CRITICAL
**
** 作　者: 陈明计
** 日　期: 2003年8月3日
**------------------------------------------------------------------------------------------------------
** 修改人: 陈明计
** 日　期: 2004年2月4日
**-------------------------------------------------------------------------------------------------------
********************************************************************************************************/
#ifndef OSWait_EN
#define OSWait_EN   0
#endif

#if OSWait_EN > 0
        uint8 OSWait(uint8 typ, uint8 ticks)    small
{
    OSWaitTick[OSTaskID] = ticks;               /* 设置超时时间         */
                                                /* 可以优化寄存器的使用  */
    switch(typ)
    {
    case K_SIG:                                 /* 等待信号，即挂起自己  */
        OSTaskSuspend(OSTaskID);
        return SIG_EVENT;
    case K_TMO:                                 /* 等待超时，即延时一段时间 */
        OSTimeDly(OSWaitTick[OSTaskID]);
        return TMO_EVENT;
    case (K_TMO | K_SIG):                       /* 等待信号（挂起自己）直到超时  */
                                                /* 别的任务或中断可以恢复它 */
        OS_ENTER_CRITICAL();
        if (OSWaitTick[OSTaskID] == 0)          /* 判断超时时间是否到   */
        {
            return TMO_EVENT;
        }
        OS_TaskSuspend(OSTaskID);               /* 任务进入等待状态     */
        OSSched();
        OS_EXIT_CRITICAL();
        if (OSWaitTick[OSTaskID] != 0)
        {
            OSWaitTick[OSTaskID] = 0;
            return SIG_EVENT;
        }
        return TMO_EVENT;
    default:
        OSWaitTick[OSTaskID] = 0;
        return NOT_OK;
    }
}
#endif
/*********************************************************************************************************
**                            End Of File
********************************************************************************************************/
